Feature: Вход в системата

  Scenario: Вход в системата с валидни потребителски данни
    Given Потребителят отваря приложението
    When Въвежда потребителско име "bibi"
    And Въвежда парола "pass"
    And Натиска бутон за вход в системата
    Then Вижда съобщението "Успешно влизане"

  Scenario: Вход в системата с невалидни потребителски данни
    Given Потребителят отваря приложението
    When Въвежда потребителско име "bib"
    And Въвежда парола "Bpass"
    And Натиска бутон за вход в системата
    Then Вижда съобщението "Грешно име/парола"
    