Feature: Търсене на творба по заглавие и автор

  Scenario: Търсене на съществуваща творба по валидни заглавие и автор
    Given Потребителят отваря разширено търсене на приложението
    When Въвежда заглавие "Your name."
    And Въвежда автор "bibi"
    And Натиска бутон за разширено търсене в системата
    Then Вижда съобщение "Търсенето е успешно!"

  Scenario: Търсене на съществуваща творба по грешно заглавие и автор 
    Given Потребителят отваря разширено търсене на приложението
    When Въвежда заглавие "Youp"
    And Въвежда автор "bibii"
    And Натиска бутон за разширено търсене в системата
    Then Вижда съобщение "Търсенето е неуспешно!"
    
  Scenario: Търсене на съществуваща творба по заглавие и грешен автор 
    Given Потребителят отваря разширено търсене на приложението
    When Въвежда заглавие "Your name."
    And Въвежда автор "bibii"
    And Натиска бутон за разширено търсене в системата
    Then Вижда съобщение "Търсенето е неуспешно!"