
Feature: Търсене на творба по заглавие

  Scenario: Търсене на съществуваща творба по заглавие  
    Given Потребителят отваря търсачката на приложението
    When Въвежда заглавие на творбата "Your name."
    And Натиска бутон за търсене в системата
    Then Вижда съобщение за търсенето "Търсенето е успешно!"

  Scenario: Търсене на съществуваща творба по грешно заглавие  
    Given Потребителят отваря търсачката на приложението
    When Въвежда заглавие на творбата "Youp"
    And Натиска бутон за търсене в системата
    Then Вижда съобщение за търсенето "Търсенето е неуспешно!"
    
  Scenario: Търсене на творба без въвеждане на заглавие  
    Given Потребителят отваря търсачката на приложението
		When Въвежда заглавие на творбата ""
    And Натиска бутон за търсене в системата
    Then Вижда съобщение за търсенето "Търсенето е неуспешно!"

    